Revit 2026 API

# ApplicationNewGeometryOptions Method

---

Creates an object to specify user preferences in parsing of geometry.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Options NewGeometryOptions()
```
```vb
Public Function NewGeometryOptions As Options
```
```cpp
public:
Options^ NewGeometryOptions()
```
```fsharp
member NewGeometryOptions : unit -> Options
```

#### Return Value

Options

#### Reference

Application Class

Autodesk.Revit.Creation Namespace